public class Main {
    public static void main(String[] args) {

        // ** [추상클래스]
        // ** 추상적 : 어떤 특정되지 않은 상태
        // ** 대상(객체)이 특정 지어지지 않은 상태
        // ** <동물>이다 라는 게 추상클래스가 되고, 사자, 코끼리 이런게 객체가 됨


        // 상속관계에서 부모는 추상클래스여야 함


        //[카드]                                               [화투] 등등
        // (하트, 다이아, 클러버, 스페이드)
        // 1
        // 2
        // 3
        // 4
        // 5
        // 6
        // 7
        // 8
        // .
        // .
        // .
        // J
        // Q
        // K



    }
}